{
    "kenya": {
        "tom-mboya": {
            "image": "images/mboya.png",
            "name": "Thomas Joseph Odhiambo Mboya (Tom Mboya)",
            "description": "Thomas Joseph Odhiambo Mboya (Tom Mboya) was a prominent Pan-African leader and a key figure in Kenya's struggle for independence. He was born on August 15, 1930, in Kilima Mbogo, Kenya. Mboya was known for his remarkable leadership skills, charisma, and unwavering commitment to the cause of African unity and development. Mboya began his political career in the 1950s, joining the Kenya African Union (KAU), a nationalist organization fighting for Kenya's independence from British colonial rule. He played a crucial role in mobilizing support for the Mau Mau rebellion and advocating for Kenya's self-governance. After Kenya gained independence in 1963, Mboya became one of the rising stars in the new government led by Jomo Kenyatta. He served as the Minister of Economic Planning and Development and played a significant role in shaping Kenya's economic policies and development agenda. Mboya believed in the importance of education as a catalyst for progress and spearheaded initiatives to expand access to education and training for the Kenyan youth. Mboyas influence extended beyond Kenyas borders, and he became a prominent advocate for Pan-Africanism. He was instrumental in organizing the All-Africa People's Conference in 1958, which brought together African leaders and intellectuals to discuss the continent's future. Mboya also played a crucial role in establishing the Pan-African Freedom Movement for East, Central, and Southern Africa (PAFMECSA), an organization that aimed to coordinate efforts for African liberation movements. Tragically, on July 5, 1969, Mboya was assassinated in Nairobi at the age of 39. His untimely death shocked the nation and the Pan-African community, cutting short the promising career of a dynamic leader. Tom Mboya's legacy continues to inspire generations of African leaders, who strive for unity, development, and social justice across the continent."
        },
        "d-kim": {
            "name": "Dedan Kimathi",
            "description": "Dedan Kimathi, born Kimathi wa Waciuri on October 31, 1920, was a prominent figure in Kenya's struggle for independence from British colonial rule. He is widely regarded as one of the most iconic freedom fighters in Kenyan history. Kimathi was born in Nyeri, a town in central Kenya, and grew up in a period of British colonization. He became actively involved in nationalist movements, particularly the Kenya African Union (KAU), which aimed to fight for self-governance and independence. Kimathi's strong leadership qualities and commitment to the cause led him to become one of the key figures in the Mau Mau uprising. The Mau Mau was a militant movement that fought against British colonial rule and sought to reclaim Kenyan land, freedom, and independence. Kimathi played a crucial role in organizing and leading the Mau Mau fighters, implementing guerrilla tactics and strategies against the British forces. Despite the harsh conditions and immense pressure from the British, Kimathi's determination and bravery inspired many. However, in 1956, he was captured by the colonial authorities and subsequently sentenced to death for his involvement in the armed struggle. On February 18, 1957, Dedan Kimathi was executed by hanging at Kamiti Maximum Security Prison. His execution sparked outrage among the Kenyan people and further fueled the anti-colonial sentiment in the country. Kimathi's legacy as a fearless freedom fighter and symbol of resistance against colonial oppression remains influential in Kenya's history and its struggle for independence."
        },
        "j-kenyatta": {
            "name": "Jomo Kenyatta",
            "description": "Jomo Kenyatta, born on October 20, 1897, in British East Africa (now Kenya), was a significant figure in Kenyan history and the struggle for independence. Kenyatta played a crucial role in shaping Kenya's path towards nationhood and served as the country's first president from 1964 until his death in 1978. Prior to his political career, Kenyatta pursued higher education in London and became involved in Pan-African movements, where he advocated for African rights and independence. In Kenya, he became a key leader in the nationalist movement and the founding father of the nation. Kenyatta's contribution to the Mau Mau movement was significant. The Mau Mau was an armed rebellion against British colonial rule in Kenya that lasted from 1952 to 1960. While Kenyatta himself did not directly participate in the armed struggle, he provided political and ideological support to the Mau Mau fighters. His nationalist views and advocacy for African land rights resonated with the grievances of the Mau Mau members, who were fighting against the dispossession of their ancestral lands by the British. Despite being imprisoned by the British authorities for his alleged involvement with the Mau Mau, Kenyatta's influence grew, and he eventually became the voice of the movement, calling for independence and self-governance. Jomo Kenyatta is regarded as a great Pan-African leader due to his unwavering commitment to the liberation and unity of Africa. He played a pivotal role not only in Kenya's struggle for independence but also in advocating for the decolonization of the entire African continent. Kenyatta was a strong advocate for African identity and self-determination, promoting the idea that Africans should have control over their own resources and destinies. His leadership and statesmanship in guiding Kenya towards independence inspired other African nations in their own fights against colonialism. Kenyatta's legacy as a Pan-African leader continues to be revered, as he contributed significantly to the collective liberation and empowerment of African people."
        }
    },
    "nigeria": {
        "amin-moha" : {
            "image":"images/Amina.jpg",
            "name": "Amina Mohammed(Nigeria)",
            "description": "Amina Mohammed is a Nigerian diplomat who is currently serving as the deputy secretary general of the United Nations2. She was born and raised in Nigeria, she holds a degree in Architecture and a master's degree in development studies from the university of Sussex. She has held several positions in both the public and private sectors including serving as Nigeria's minister of Environment3. As an environmentalist, she has actively championed sustainable development and played a key role in shaping the United Nations sustainable development goals (SDGs) and raising awareness about environmental conservation, climate change and gender equality in and beyond Africa. Her work focuses on promoting social and economic development while ensuring environmental sustainability. Her work on sustainable development and climate change has made her a leading voice on these issues in Africa and around the world4. Amina's dedication to environmental issues and commitment to achieving the SDGs highlight the significance of balancing economic growth with environmental stewardship and her leadership demonstrates the potential for African leaders to drive positive change on a global scale."
        },
        "olu-oba": {
            "image":"images/Olusegun.jpg",
            "name": "Olusegun Obasanjo",
            "description": "Olusegun Obasanjo is a former Nigeria military head of state and later served as the president of Nigeria. He is regarded as a Pan African leader due to his significant contribution to peacekeeping efforts and regional integration5. He held several high-ranking positions within the Nigeria military including serving as the chief of staff of the Nigerian Army. After retiring from the military, Obasanjo became involved in politics and was elected as the president of Nigeria, serving two terms6. Obasanjo played a vital role in peacekeeping efforts and conflict resolution across Africa. He led the military in various peacekeeping missions including those in Angola, Congo, and Sierra Leone and as the president of Nigeria, he actively supported the African Union and regional initiatives7. He played a key role in ending apartheid in South Africa and was instrumental in establishing the new partnership for Africa's development (NEPAD) which aims to promote economic development and reduce poverty in Africa. He also worked towards strengthening regional cooperation and good governance across the continent8. Obasanjo's leadership highlights the significance of diplomacy, cooperation, and Pan-Africanism in addressing challenges and promoting sustainable development. Obasanjo's commitment to conflict resolution and regional integration demonstrates the potential for African countries to collaborate and work towards common goals."
        },
        "nnaz": {
            "image":"images/Nnamdi.jpeg",
            "name": "Nnamdi Azikiwe",
            "description": "Nnamdi Azikiwe is popularly known as “Zik of Africa” who was a Nigerian statesman and first president of Nigeria. He is widely recognized as a Pan African leader due to his pivotal role in Nigeria's struggle for independence and his advocacy for African unity. He was born in Nigeria, and received his education in Nigeria, the United States, and the United Kingdom. He was a prominent journalist and political activist who played a crucial role in Nigeria's nationalist movement9. Azikiwe was one of the founding fathers of the Organization of African Unity (OAU) which later became the African Union (AU). He actively participated in Pan African conferences and forums where he championed the cause of self-determination, political independence, and economic cooperation among African nations. He believed in the liberation of African countries from colonial rule and worked towards promoting African cultural and intellectual development10. The life of Nnamdi Azikiwe is an expression of self-determination and the relentless pursuit of liberation that can serve as an inspiration for present and future leaders in their quest for a united and prosperous Africa."
        },
        "ngozi": {
            "image":"images/Ngozi.jpg",
            "name": "Ngozi Okonjo-Iweala",
            "description": "Ngozi is a Nigerian economist who has made significant contributions to Pan African economic development and international governance. She holds a Ph.D in Economics from MIT and has had a distinguished career in both the public and private sectors. She has served as Nigeria's minister of Finance and later as the Managing Director of the World Bank11. Her contribution to Pan Africanism lies in her efforts to promote economic development in Africa. She has been a strong advocate for reducing poverty, addressing economic inequalities, and fostering sustainable growth across the continent. As the Minister of finance of Nigeria, she implemented economic reforms that helped improve governance, accountability, and transparency. She also played a crucial role in debt relief negotiations for African countries that led to significant debt reduction and increased financial stability12. Furthermore, Okonjo-Iweala made history by becoming the first African and first woman to serve as the Director-General of the World Trade Organization (WTO) in 2021. In this role, she has been actively working to address trade barriers and promote fair trade practices that benefit African nations. With Ngozi as an African involved in international institutions and economic reforms, has helped the continent to gain from global policies."
        },
        "akin-ade": {
            "image":"images/Akinwumi.jpg",
            "name": "Akinwumi Adesina",
            "description": "Akinwumi Adesina is a Nigerian agricultural economist and the President of the African Development Bank (AfDB)1. He is recognized as a Pan African leader for his contributions to agricultural transformation, economic development, and regional integration. Under his leadership, the AfDB has implemented various initiatives to promote agricultural transformation, food security, and rural development across the continent. Adesina has actively advocated for increased investment in agriculture, access to finance for smallholder farmers, and the use of innovative technologies to boost agricultural productivity13. He has also prioritized regional integration, supporting projects that enhance cross-border trade and economic cooperation in Africa. Adesina's work emphasizes the significance of investing in the agricultural sector to achieve sustainable development and economic prosperity in Africa. Adesina's work emphasizes the significance of investing in the agricultural sector to achieve sustainable development and economic prosperity in Africa which highlights the potential for African leaders to drive agricultural transformation, enhance food security, and promote regional integration."
        }
    },
    "tanzania": {
        "nyerere": {
            "name": "Julius Nyerere",
            "description": "Julius Kambaraga Nyerere was a Tanzanian anti-colonial activist, political theorist. He governed as a prime minister and president of Tanganyika and Tanzania. He is also known as an African nationalist and Pan African socialist through the promotion of a political philosophy referred to us Ujamaa.He helped in the unification of the Island of Zanzibar and Tanganyika to form Tanzania. Across Africa, he is well known as an anti-colonialist and in power is known to have gotten praises for ensuring that Tanzania remained stable and unified in the decades after independence. Also, he has been described as the “Father of the Nation” within Tanzania and across Africa."
        }
    },
    "burundi": {
        "mel": {
            "name": "Melchior Ndadaye",
            "description": "Melchior Ndadaye, born on March 28, 1953, in Butihinda, Burundi, was a prominent Burundian political leader and the first democratically elected president of Burundi. He emerged as a key figure during a period of political transition in Burundi. Ndadaye belonged to the Hutu ethnic group, which had historically been marginalized in Burundian politics. He founded the Front for Democracy in Burundi (FRODEBU) party and led the movement for political and social change in the country. In 1993, Ndadaye's FRODEBU party won the country's first multi-party elections, marking a significant turning point in Burundi's history. Internally, Ndadaye faced numerous challenges and conflicts as president. His presidency was marred by ethnic tensions between the Hutu majority and the Tutsi minority, which had dominated Burundian politics for decades. Tragically, just three months into his presidency, Ndadaye was assassinated in a failed coup attempt by members of the Tutsi-dominated military. His assassination led to a violent escalation of ethnic tensions and widespread violence across the country. The internal conflicts and the subsequent civil war that followed Ndadaye's death caused immense suffering and loss of life in Burundi. Melchior Ndadaye is regarded as a great Pan-African leader due to his unwavering commitment to unity, democracy, and social justice. He sought to bridge the ethnic divides within Burundi and worked towards national reconciliation. Ndadaye's rise to power as the first democratically elected Hutu president in Burundi was seen as a significant step towards inclusive governance and breaking the cycle of ethnic dominance. He promoted Pan-African ideals of equality, human rights, and African unity. Although his presidency was tragically cut short, Ndadaye's vision for a united and peaceful Burundi continues to inspire many and solidify his reputation as a great Pan-African leader."
        },
        "prince": {
            "image":"images/Prince.jpeg",
            "name": "Prince Louis Rwagasore",
            "description": "Prince Louis Rwagasore was a prominent figure in Burundi's history and played a significant role in the country's struggle for independence. He was the son of King Mwambutsa IV of Burundi and was born on January 10, 1932. He was educated in Belgium and later returned to Burundi with a strong commitment to fighting for his country's liberation from colonial rule. Prince Louis Rwagasore was a charismatic and influential leader who founded the political party UPRONA (Union for National Progress) in 1958. UPRONA aimed to bring together Burundi's diverse ethnic groups and work towards independence. Under his leadership, UPRONA achieved a landslide victory in the 1961 elections, securing a majority in the Legislative Assembly. Tragically, Prince Louis Rwagasore's life was cut short when he was assassinated on October 13, 1961, just a few months before Burundi gained independence from Belgium. His assassination was a devastating blow to Burundi, as he was widely regarded as a unifying and visionary leader. Prince Louis Rwagasore is remembered as a national hero in Burundi, and his contributions to the country's struggle for independence are highly revered. His legacy continues to inspire and serve as a symbol of Burundi's quest for freedom, unity, and progress. Prince Louis Rwagasore can be described as a Pan-Africanist because as a leader and advocate for Burundi's independence, he embraced a Pan-African perspective that emphasized unity, solidarity, and the liberation of African nations from colonial rule. He sought to foster a sense of African identity and cooperation, recognizing the importance of continental unity in the struggle for self-determination. Prince Louis Rwagasore's Pan-Africanist beliefs and actions aligned with the broader movement for African independence and the ideals of Pan-Africanism, which aimed to unite African nations and promote their collective interests."
        }
    },
    "rwanda": {
        "kagame": {
            "name": "Paul Kagame",
            "description": "Paul Kagame, born on October 23, 1957, in Rwanda, is a prominent figure in contemporary African politics. He became involved in politics as a young man and rose to prominence as a military leader during the Rwandan Civil War and the subsequent Rwandan genocide in 1994. Kagame's leadership skills and strategic acumen were instrumental in ending the genocide and establishing stability in Rwanda. In 2000, he was elected as the president of Rwanda and has since been reelected multiple times. Kagame is known for his efforts to rebuild and develop Rwanda, focusing on economic growth, infrastructure development, and social reforms. Internally, Kagame faced the immense challenge of post-genocide reconciliation and rebuilding. He implemented policies to promote unity and healing, encouraging Rwandans to move beyond the ethnic divisions that had fueled the genocide. However, his government has also faced criticism for its approach to political dissent, with allegations of human rights abuses and suppression of opposition voices. On the international stage, Kagame's leadership has been marked by tensions with European countries. He has been critical of Western involvement in Africa and has called for greater self-reliance and independence from foreign aid and influence. Paul Kagame is regarded as a great Pan-African leader for several reasons. Firstly, his leadership in rebuilding Rwanda after the devastating genocide has been widely acknowledged. Under his leadership, Rwanda has made significant strides in economic development, healthcare, and education. Secondly, Kagame has played an active role in regional diplomacy and conflict resolution, particularly in the Great Lakes region of Africa. He has been involved in peacekeeping efforts and has worked towards promoting stability and cooperation among neighboring countries. Finally, Kagame has been a vocal advocate for African unity and self-determination. He has emphasized the need for Africans to take charge of their own development and has called for increased collaboration and integration among African nations. Kagame's vision for a prosperous and united Africa has garnered respect and admiration from many across the continent."
        }
    },
    "mozambique": {
        "samora": {
            "name": "Samora Machel",
            "description": "Samora Machel, born on September 29, 1933, in Mozambique, was a prominent figure in the fight against colonialism and the struggle for independence in Southern Africa. He emerged as a key leader during the Mozambican War of Independence against Portuguese colonial rule. Machel was a charismatic and influential figure, known for his strong leadership qualities and commitment to socialist principles. After Mozambique gained independence in 1975, Machel became the country's first president. He focused on implementing policies that aimed to improve the lives of ordinary Mozambicans, including land redistribution, education, and healthcare reforms. Tragically, Machel died in a plane crash in 1986, cutting short his political career and leaving a lasting impact on the region. Internally, Machel faced challenges in the form of armed conflicts with opposition groups, particularly the Mozambican National Resistance (RENAMO). RENAMO, supported by external forces, waged a brutal insurgency against the Mozambican government. Machel also faced economic difficulties, as Mozambique struggled with the legacy of colonial exploitation and the need to rebuild after years of war. On the international stage, Machel confronted external conflicts. He was critical of South Africa's apartheid regime and supported the African National Congress (ANC) in their struggle against racial oppression. This brought him into conflict with the South African government and its allies. Samora Machel is widely regarded as a great pan-African leader due to his unwavering commitment to African liberation and unity. He played a crucial role in the fight against colonialism, not only in Mozambique but also in the broader struggle for Southern African independence. Machel's advocacy for self-determination and his support for other liberation movements in the region, such as the ANC in South Africa, earned him respect and admiration from fellow African leaders. His vision for a united and prosperous Africa, free from the shackles of colonialism, resonated with many across the continent. Machel's legacy as a pan-Africanist leader continues to inspire and influence generations striving for freedom, justice, and self-determination in Africa."
        }
    },
    "burkina-faso":{
        "sankara": {
            "image":"images/Sankara.jpg",
            "name":"Thomas Sankara",
            "description": "Thomas Sankara, born on December 21, 1949, in Upper Volta (now Burkina Faso), was a prominent figure in African history. He rose to power in 1983 as the president of Burkina Faso through a military coup. Sankara was known for his strong socialist and pan-Africanist ideals. During his time in power, he implemented various policies aimed at improving the living conditions of the Burkinabe people, such as land redistribution, education reform, and women's rights advocacy. Sankara's personal charisma and dedication to the principles of self-reliance and dignity for African nations made him a beloved leader among his people. Internally, Sankara faced several challenges and conflicts. He pursued an ambitious agenda of social and economic transformation, which involved challenging the traditional power structures and interests within Burkina Faso. This led to tensions with various factions, including the military and traditional leaders. Additionally, Sankara's policies often faced resistance from external forces, particularly European powers and international financial institutions. These conflicts stemmed from his refusal to comply with Western influence and his commitment to charting an independent and self-sufficient path for Burkina Faso. Thomas Sankara is widely regarded as a great pan-African leader due to his unwavering commitment to African liberation and self-determination. He advocated for the unity of African nations, challenging the neocolonial legacy and the exploitation of African resources by foreign powers. Sankara promoted African cultural identity and urged Africans to take control of their own destinies. His emphasis on self-sufficiency and his efforts to build a self-reliant Burkina Faso inspired many across the continent. Sankara's vision for a united and prosperous Africa, coupled with his dedication to the well-being of his people, earned him a place among the most respected and revered African leaders of all time."
        }
    },
    "senegal": {
        "chel-anta": {
            "name":"Cheikh Anta Diop",
            "description": "Cheikh Anta Diop was a Senegalese historian, physicist, anthropologist, politician, and a major world scholar. He was born on 29 December 1923, in Diourbel region of Senegal, to a wolof family. He moved to Paris in 1946 to study Physics under the guidance of Fréderic Joliot-Curie, Marie Curie's son in law. During this time, Diop was involved in the African students' anticolonial movement, and he helped create the Association of African Students in Paris. These movements laid the foundation for the growing African independence sentiments. The Sorbonne, University of Paris, rejected his doctorate thesis in 1951. The thesis was based on the idea that ancient Egypt had been a black culture. This was at a time when European cultural superiority was the accepted notion. Diop proclaimed, with evidence, that African civilizations were the inspiration and origin of European accomplishments. He did not give up, and in 1955, the thesis was published in the popular media as a book titled Nations nègres et culture ('Black Nations and Culture'). This work would transform him into the most controversial historian of his time. He successfully defended his thesis and earned his doctorate degree in 1960. He also published Les fondements économiques et culturels d'un Etat fédéral d'Afrique Noire ('The Economic and Cultural Aspects of a Federal State in Black Africa') that same year. Diop returned to Senegal and continued his writing and research. He was appointed a research fellow at the  Institut Fondamental d'Afrique Noire (IFAN) at Dakar University. To aid his research, the University of Dakar established a radiocarbon dating laboratory. The historian used this technique to determine the contents of melanin in Egyptian mummies. Subsequently, forensic researchers would adapt his technique to determine the 'racial identity' of victims that had been seriously damaged by abrasion. Diop also began his political activities by participating in the creation of the opposition party, the Bloc des Masses Sénégalaises (BMS) which opposed the pro-French policies of President Senghor's government.  He was jailed in July of 1962, but then freed without charges in August of that same year. In 1963, the BMS was declared to be illegal and dissolved, but a new party was created which was also dissolved by the government of President Léopold Sédar Senghor in 1964. Diop published several books over his career, including seven of which were translated into English. Diop was appointed professor of ancient history at the University of Dakar in 1980. He received the highest award for scientific research from the Institut Cultural Africain in 1982. In 1974, he participated in a UNESCO symposium in Cairo, where he presented his theories to other specialists in Egyptology. He also wrote the chapter about Egyptian origins in the UNESCO's General History of Africa. He was invited to Atlanta, Georgia in 1985, where Mayor Andrew Young announced April 4th “Dr. Cheikh Anta Diop Day.” In February 1986, Cheikh Anta Diop died in Dakar."

        }
    },
    "ghana": {
        "nkrumah": {
            "image":"images/Kwame.jpg",
            "name": "Kwame Nkrumah",
            "description": "Kwame Nkrumah was born in Nkroful, Gold Coast (now Ghana), he studied at Achimota College and later pursued his higher education in the United States and United Kingdom where he earned a bachelor's degree in economics and a master's degree in philosophy respectively15. Nkrumah played a vital role in Ghana's struggle for independence from British rule and he founded the Conventional people's party (CPP) in 1949 which advocated for self-governance and Pan-Africanism. His contribution to Pan-Africanism was his relentless pursuit of continental unity and decolonization; he believed that the liberation of Africa could only be achieved through a united Africa, free from external influence. Nkrumah played a crucial role in the formation of the Organization of African Unity (OAU) in 1963, which aimed to promote African unity, cooperation, and solidarity16. Nkrumah's vision and leadership inspired other African leaders and played a significant role in shaping the decolonization movement and the subsequent independence of many African nations. Dr. Kwame Nkrumah was raised by his mother and his extended family who stayed together as tradition demanded where more family relatives had an interest in taking care of each other children. He had his elementary school in Ghana. He later obtained a teacher ‘s certificate from the Prince of Wales College at Achimota in 1930 where he taught for some time before finally deciding to further his education. He obtained his bachelor’s degree in economics and sociology in 1939 at Lincoln University and a Master of Arts degree in philosophy and a Master of Science in education from Penn University. And then went to the London School of Economics to obtain his Ph.D Nkrumah came back to lead Ghana to attain her independence on 6 March 1957 from British colonial rule. During his term, he fought for the elimination of tribalism and thus coined the term “Africa Must Unite” where an act was passed to prohibit organizations from using racial or tribal in their operations which led to a subsequent ban on tribal flags and rather promoted the use of the national flag. He actively promoted a policy of Pan-Africanism since he assumed the presidency. This was seen in his active organization of conferences and programs that brought together people from all over the African continent. Some of the included the first conference of independent states, the more inclusive All-African People’s Conference, the All-African Trade Union Federation, and the Conference of African Women. All these were to bring together Africans to work together and see us as one people. This led to the creation of the OAU in Addis Ababa in 1963 and was committed to also creating a united military force, the African High Command. All these activities and characters portrayed by Kwame Nkrumah showed how committed he was to ensuring that the African continent was united and saw each as one capable of managing her own affairs. As a pan-African, you don’t limit your influence and change-making to only your home country but rather have a mindset that considers the African continent."
        },
        "joe": {
            "name": "Joseph Ephraim Casely Hayford",
            "description": "He is a Ghanaian who was a barrister, author, and political leader of West Africa dedicating his life to helping promote a better life and living conditions for the people of West Africa. He had his high school education both in Ghana and in Freetown, Sierra Leone at Wesleyan Boys High School and Fourah Bay College respectively. Later, he went to the University of Cambridge London where he became a barrister. After having received his education, he returned back to Ghana to support the Aborigine Rights Protection Society. Which was a group committed to advancing the cause of indigenous Africans. Through his hard work and dedication and willingness to help Africans, he co-founded the National Congress of British West Africa; a political movement in West Africa that worked so hard towards the liberation of the African continent together. All his life activities and initiatives as mentioned above, showed the passion of Casely Hayford for the development of a Liberated African continent. Worthy of emulation by all aspiring pan-Africanist."
        },
        "ama": {
            "name": "Ama Atta Aidoo",
            "description": "She is a Ghanaian author, poet, playwright, politician, and academician who was born in the central region of Ghana. She had her early education in Ghana where she attended Wesley Girls Senior High and then the University of Ghana to obtain her B.An in English. She is notable for her first play, The Dilemma of a Ghost in the year, in 1964. Ama Atta Aidoo was an active pan-Africanist committed to the Pan-African movement through her literary works. These usually span themes such as feminism, African identity, and some challenges African nations are faced with, and are therefore known for her strong advocacy for intellectual independence and African cultural promotion."
        }
    },
    "democratic-republic-of-the-congo":{
        "lumumba": {
            "image":"images/Patrice.jpg",
            "name": "Patrice Lumumba(DRC)",
            "description": "He was a Congolese politician and an independent leader who became the first prime minister of DRC. He was the leader of the Congolese National Moment from the year of 1950 until his execution in January 1961. Ideologically an African nationalist and pan-Africanist, he played a significant role in the transformation of Congo from a colony of Belgium into an independent republic. He committed his life to liberate the DRC to the extend that he was executed by firing squad. Following his execution, he was seen as a martyr for the wider pan-African movement. His sown fall was seen as detrimental to the African nationalist movements and generally remembered for his assassination for his activism to unite the Congolese."
        }
    },
    "south-africa": {
        "mandela": {
            "name": "Nelson Mandela",
            "description": "He was a south African and the first black nationalist and president of South Africa. Where he supported towards the end of the country's apartheid system of racial segregation and ushered in a peaceful transition to majority rule. He attended South African Native College (later the University of Fort Hare) and studied law at the University of the Witwatersrand; he later passed the qualification exam to become a lawyer. In 1944 he joined the African National Congress (ANC), a Black-liberation group, and became a leader of its Youth League. That same year he met and married Evelyn Ntoko Mase. In December 1956 he was arrested with more than 100 other people on charges of treason that were designed to harass antiapartheid activists. Mandela went on trial that same year and eventually was acquitted in 1961. After leaving office Mandela retired from active politics but maintained a strong international presence as an advocate of peace, reconciliation, and social justice, often through the work of the Nelson Mandela Foundation, established in 1999. He was a founding member of the Elders, a group of international leaders established in 2007 for the promotion of conflict resolution and problem-solving throughout the world. In 2008 Mandela was feted with several celebrations in South Africa, Great Britain, and other countries in honor of his 90th birthday. His great works were recognized across the world and was once described by the historian Sabelo J. Ndlovu-Gatsheni 'liberal African nationalist decolonial humanist', while political analyst Raymond Suttner cautioned against labeling Mandela a liberal and stated that Mandela displayed a 'hybrid socio-political make-up'. He had exhibited a commitment to the values of democracy and human rights since at least the 1960s. He held a conviction that 'inclusivity, accountability and freedom of speech' were the fundamentals of democracy, and was driven by a belief in natural and human rights."
        }
    },

    "zimbabwe": {
        "moyo": {
            "image":"images/Nkosana.jpg",
            "name": "Dr. Nkosana Moyo",
            "description": "Dr. Nkosana Moyo is a Zimbabwean economist and politician. While he has been involved in African politics and has advocated for regional integration and development. Dr. Moyo served as Zimbabwe's Minister of Industry and International Trade from 2000 to 2001. He later held senior positions at the African Development Bank (AfDB), including Vice President and Chief Operating Officer. His work at the AfDB focused on promoting economic development and regional integration in Africa14. Dr Nkosana is the founder of MINDS Africa, an Africa-based non-profit organization that was established in 2010 to address the development challenges and opportunities in Africa14. Dr Moyo advocates for African unity and development."
        }
    },

    "egypt": {
        "gamal":{
            "image":"images/Gamal.jpg",
            "name": "Gamal Abdel Nasser",
            "description": "Gamal born in Alexandria, Egypt, joined the Egyptian military academy and became involved in nationalist and anti-colonial movements during his time in the military. Nasser rose to prominence as a leader in the 1952 Egyptian Revolution, which overthrew the monarchy and established a republic. He became the second President of Egypt in 1956 and played a crucial role in shaping Egyptian and Pan-African history19. Nasser's remarkable contribution to Pan-Africanism was his active support for African liberation movements and his vision of Arab-African unity. He provided military and financial assistance to several African countries in their struggles against colonialism and advocated for unity among African and Arab nations. Nasser believed that only through solidarity and cooperation could Africa and the Arab world overcome their common challenges and realize their aspirations. Nasser's leadership and his efforts to unite Arab and African nations demonstrated the potential for collective action and the power of shared interests and aspirations."

        }
    }


}